In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [4]:
df = pd.read_csv('Dataset/Ahemdabad.csv', skiprows = 15)
df.head()

   YEAR  MO  DY  T2M_MAX    T2M  T2M_MIN     TS   RH2M      PS  T2MDEW
0  1981   1  30    32.74  23.66    16.23  24.46  39.62  100.66    8.44
1  1981   1  31    29.87  20.52    13.20  21.29  24.56  100.78   -3.58
2  1981   2   1    28.83  18.56     9.97  19.13  17.00  101.13   -7.96
3  1981   2   2    29.18  18.76     9.08  19.08  20.62  101.13   -5.92
4  1981   2   3    32.55  21.55    10.51  20.84  16.69  100.90   -6.55

In [5]:
df['YEAR'] = df.YEAR.astype(str)
df['MO'] = df.MO.astype(str)
df['DY'] = df.DY.astype(str)

df['dateTime'] = df['YEAR'].str.cat(df['MO'])
df['dateTime'] = df['dateTime'].str.cat(df['DY'])

df.drop(['YEAR', 'MO', 'DY'], axis=1, inplace=True)

In [6]:
df['dateTime'] = pd.to_datetime(df['dateTime'], format = '%Y%m%d')
df.set_index('dateTime', inplace = True)
df.head()

            T2M_MAX    T2M  T2M_MIN     TS   RH2M      PS  T2MDEW
dateTime
1981-01-30    32.74  23.66    16.23  24.46  39.62  100.66    8.44
1981-01-31    29.87  20.52    13.20  21.29  24.56  100.78   -3.58
1981-02-01    28.83  18.56     9.97  19.13  17.00  101.13   -7.96
1981-02-02    29.18  18.76     9.08  19.08  20.62  101.13   -5.92
1981-02-03    32.55  21.55    10.51  20.84  16.69  100.90   -6.55

In [8]:
temp_max = df['T2M_MAX']
temp_max = np.array(temp_max)
temp_max.shape

(15390,)

In [9]:
heatwave = np.zeros(temp_max.shape[0])